# language: ru

@adminsOrders
Функция: Проверка юзкейсов админа
  @adminsOrdersChangeStatus
  Сценарий: Изменения статуса заказа
    Допустим Я нахожусь на странице списка заказов для админа
    И Выбираю статус "В обработке" в поле 0 "статус заказа"
    И Я вижу статус "В обработке" в поле 0 "статус заказа"
    И Выбираю статус "В работе" в поле 0 "статус заказа"
    И Я вижу статус "В работе" в поле 0 "статус заказа"
    И Выбираю статус "Завершен" в поле 0 "статус заказа"
    И Я вижу статус "Завершен" в поле 0 "статус заказа"
    И Выбираю статус "Отклонен" в поле 0 "статус заказа"
    И Я вижу статус "Отклонен" в поле 0 "статус заказа"
    И Выбираю статус "Отменен" в поле 0 "статус заказа"
    И Я вижу статус "Отменен" в поле 0 "статус заказа"

  @adminsOrdersCurrentInfo
  Сценарий: Открытие информации о заказе
    Допустим Я нахожусь на странице списка заказов для админа
    И Я копирую "имя клиента" из поля 0 нажимаю на поле 0 вижу "имя клиента"
    То Я вижу "Информация о заказе"

  @adminsOrdersGoToCheckout
  Сценарий: Переход к оформлению заказа
    Допустим Я нахожусь на странице списка заказов для админа
    И Я нажимаю на "Добавить заказ"
    То Я вижу "Оформление заказа"

  @adminsOrdersGoToEdit
  Сценарий: Переход к редактированию заказа заказа
    Допустим Я нахожусь на странице списка заказов для админа
    И Я нажимаю на поле 0
    То Я вижу "Информация о заказе"
    И Я нажимаю на "Редактировать"
    И Я ввожу номер телефона "7777777777" в поле "phone"
    И Я ввожу "имя" "Имя" в поле "firstName"
    И Я ввожу "фамилию" "Фамилия" в поле "lastName"
    И Я ввожу "адрес" "Адрес" в поле "address"
    И Я ввожу статус "В обработке" в поле "статус заказа"
    И Я нажимаю на "Сохранить"
    То Я не вижу "Отменить"